IDEA StatiCa Open Model
SetupValueLong Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value long
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueLong
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SetupValueLong : SetupValue
Public Class SetupValueLong
	Inherits SetupValue
public ref class SetupValueLong : public SetupValue
The SetupValueLong type exposes the following members.
Constructors
Name | Description
SetupValueLong
Initializes a new instance of the SetupValueLong class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from SetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace